//HCHRJK0A JOB ('#SALESSUP'),'IB4OP01R     ', TYPRUN=SCAN,
//             CLASS=A,MSGCLASS=R,NOTIFY=&SYSUID
/*JOBPARM S=*
//* JCL LOCATION: ISPW
//* STREAM: FTSDEMO
//* APPLICATION: RJK1
//* COMPONENT: IB4OP01
//* *******************************************************************
//*------------------------------------------------------
//*   IMS 13 ON CWCC
//*   USE IMS PSB AS DEFINED FOR TTT
//*   THIS IS A BATCH DLI PROGRAM
//*------------------------------------------------------
//*
//DLI    EXEC PGM=DFSRRC00,REGION=4096K,
//   PARM=(DLI,IB4OP01,IB4OP01,,0000,,,,,,,IE01,,N,N,JE01,N,,,,,,)
//STEPLIB  DD DSN=IMS131A.CWCC.SDFSRESL,DISP=SHR
//         DD DSN=IMS131A.SDFSRESL,DISP=SHR
//         DD DISP=SHR,DSN=SALESSUP.RJK1.FIX.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.EMR.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.DEV1.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.DEV2.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.DEV3.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.QA1.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.QA2.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.QA3.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.STG.LOAD
//         DD DISP=SHR,DSN=SALESSUP.RJK1.PRD.LOAD
//* DATASETS USED BY IMS TO CONTROL THE ENVIRONMENT
//DFSRESLB DD DISP=SHR,DSN=IMS131A.CWCC.SDFSRESL
//         DD DISP=SHR,DSN=IMS131A.SDFSRESL
//PROCLIB  DD DSN=IMS131A.CWCC.PROCLIB,DISP=SHR
//* -------------------------------------------------------
//IMS      DD DISP=SHR,DSN=SALESSUP.KT.IMS131A.PSBLIB
//         DD DISP=SHR,DSN=SALESSUP.KT.IMS131A.DBDLIB
//* FOLLOWING CAN/SHOULD BE CHANGED (TO ELIMINATE THE DFHEJK0 HLQ)
//*  IT IS FOR THE IMS LOG (COULD BE A TEMPORARY DISK FILE)
//IEFRDER  DD DISP=(MOD,KEEP),DSN=SALESSUP.TTT.IMS.BATCH.LOG,
//            UNIT=SYSDA,SPACE=(CYL,(1,1)),
//            DCB=BLKSIZE=6144
//KTPORDRD DD DISP=SHR,DSN=SALESSUP.KT.IMS131A.KTPORDR
//KTPXODD1 DD DISP=SHR,DSN=SALESSUP.KT.IMS131A.KTPXORD1
//KTPXODD2 DD DISP=SHR,DSN=SALESSUP.KT.IMS131A.KTPXORD2
//KTPCUSTD DD DISP=SHR,DSN=SALESSUP.KT.IMS131A.KTPCUST
//DFSVSAMP DD *
POOLID=FF
VSRBF=4096,4,I
VSRBF=8192,4,D
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//* DATASETS USED BY THE APPLICATION PROGRAM
//PRINT1   DD SYSOUT=*
//PRINT2   DD SYSOUT=*
//TRANS    DD *
Q AA4444
Q AA4994
A AA4994444444ADDED ORDER                             010000200050NN1
Q AA4994
UBAA4994      CHANGED DESCRIPTION XXXXXXXXXXXXXXXXXXXX     0200000
Q AA4994
UBAA4994221122                                        00100       XX2
Q AA4994
D AA4994
Q AA4994
//* LAYOUT OF TRANSACTIONS:
//* TT TRANS CODE: A - ADD, Q - QUERY, D - DELETE, UB - UPDATE BASE
//*  UA - UPDATE ACTIVITY DATA
//* OOOOOO - ORDER NUMBER; CCCCCC - CUSTOMER NUMBER
//* DESCRIPTION - SELF EXPLANATORY; QQQQQ - QUANTITY
//* AAAAAAA - AMOUNT (2 IMPLIED DEC. PLACES); TT - TYPE
//* P - PRIORITY
//* ABOVE IS FOR A AND UB TRANSACTIONS; SEE PROGRAM SOURCE AND COBCOPY
//*   FOR "UA" TRANS; FOR Q AND D TRANS ONLY TRANS AND OOOOOO ARE NEEDED.
TTOOOOOOCCCCCC<-----------DESCRIPTION---------------->QQQQQAAAAAAATTP