//HCHRJK0X JOB IMSTECH,
// 'IMS13 MPR #1    ',
// CLASS=A,
// MSGCLASS=X,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=512M
//*
/*JOBPARM  L=9999,R=DPH,S=CWCC
//*
//IMSDPROC  JCLLIB ORDER=SALESSUP.RJK1.PRD.JOB
//IMSDMR01 EXEC PROC=DFSMPR01,TIME=(1440),
//         NBA=6,
//         OBA=5,
//         SOUT='*',              SYSOUT CLASS
//         CL1=041,               TRANSACTION CLASS 1
//         CL2=042,               TRANSACTION CLASS 2
//         CL3=043,               TRANSACTION CLASS 3
//         CL4=044,               TRANSACTION CLASS 4
//         TLIM=10,               MPR TERMINATION LIMIT
//         SOD=,                  SPIN-OFF DUMP CLASS
//         IMSID=IDCC,            IMSID OF IMS CONTROL REGION
//         PREINIT=DC,            PROCLIB DFSINTXX MEMBER
//         PWFI=Y                 PSEUDO=WFI
//*
//* OVERRIDE PROC DD STATEMENTS
//*
//* --NONE--
//*
//* ADDITIONAL DD STATEMENTS
//*
//DFSCTL   DD DISP=SHR,
//            DSN=IMS131A.CWCC.PROCLIB(DFSSBPRM)
//DFSSTAT  DD SYSOUT=*
//* REXX EXEC SOURCE LOCATION
//SYSEXEC  DD DISP=SHR,
//            DSN=IMS131A.CWCC.INSTALIB
//         DD DISP=SHR,
//            DSN=IMS131A.SDFSEXEC
//* REXX INPUT LOCATION WHEN STACK IS EMPTY
//SYSTSIN  DD *
/*
//* REXX OUTPUT LOCATION
//SYSTSPRT DD SYSOUT=*
//* COBOL OUTPUT LOCATION
//SYSOUT   DD SYSOUT=*
//* COBOL ABEND OUTPUT LOCATION
//SYSABOUT DD SYSOUT=*
//*